tests/Iyzipay/Tests/mock/retrieve-iyziup-form.json

{
  "status": "failure",
  "errorCode": "10000",
  "errorMessage": "error message",
  "errorGroup": "ERROR_GROUP",
  "locale": "tr",
  "systemTime": 1458545234852,
  "conversationId": "123456",
  "orderResponseStatus": "payment_completed",
  "token": "token",
  "callbackUrl": "www.callback.uri",
  "consumer": {
    "name": "Jane",
    "surname": "Doe",
    "identityNumber": "11111",
    "email": "consumer@mail.com",
    "gsmNumber": "+905490000000"
  },
  "shippingAddress": {
    "address": "19 Mayıs Mah. İnönü Cad. No:45 Kozyatağı",
    "zipCode": "34742",
    "contactName": "John Doe",
    "city": "İstanbul",
    "country": "Türkiye"
  },
  "billingAddress": {
    "address": "19 Mayıs Mah. İnönü Cad. No:45 Kozyatağı",
    "zipCode": "34742",
    "contactName": "John Doe",
    "city": "İstanbul",
    "country": "Türkiye"
  },
  "paymentDetail": {
    "price": 1.0,
    "paidPrice": 1.1,
    "installment": 1,
    "paymentId": "1",
    "paymentStatus": "failure",
    "fraudStatus": 1,
    "merchantCommissionRate": 10.00000000,
    "merchantCommissionRateAmount": 0.1,
    "iyziCommissionRateAmount": 0.03245000,
    "iyziCommissionFee": 0.29500000,
    "cardType": "CREDIT_CARD",
    "cardAssociation": "MASTER_CARD",
    "cardFamily": "Bonus",
    "cardUserKey": "cardUserKey",
    "cardToken": "cardToken",
    "binNumber": "554960",
    "basketId": "B67832",
    "currency": "TRY",
    "connectorName": "connector name",
    "authCode": "auth code",
    "phase": "AUTH",
    "lastFourDigits": "0000",
    "itemTransactions": [
      {
        "itemId": "BI101",
        "paymentTransactionId": "4977",
        "transactionStatus": 2,
        "price": 0.3,
        "paidPrice": 0.33000000,
        "merchantCommissionRate": 10.00000000,
        "merchantCommissionRateAmount": 0.03000000,
        "iyziCommissionRateAmount": 0.00973500,
        "iyziCommissionFee": 0.08850000,
        "blockageRate": 10.00000000,
        "blockageRateAmountMerchant": 0.03300000,
        "blockageRateAmountSubMerchant": 0,
        "blockageResolvedDate": "2016-03-28 09:27:14",
        "subMerchantKey": "subMerchantKey",
        "subMerchantPrice": 0,
        "subMerchantPayoutRate": 0E-8,
        "subMerchantPayoutAmount": 0,
        "merchantPayoutAmount": 0.19876500,
        "convertedPayout": {
          "paidPrice": 0.33000000,
          "iyziCommissionRateAmount": 0.00973500,
          "iyziCommissionFee": 0.08850000,
          "blockageRateAmountMerchant": 0.03300000,
          "blockageRateAmountSubMerchant": 0E-8,
          "subMerchantPayoutAmount": 0E-8,
          "merchantPayoutAmount": 0.19876500,
          "iyziConversionRate": 0,
          "iyziConversionRateAmount": 0,
          "currency": "TRY"
        }
      },
      {
        "itemId": "BI102",
        "paymentTransactionId": "4978",
        "transactionStatus": 2,
        "price": 0.5,
        "paidPrice": 0.55000000,
        "merchantCommissionRate": 10.00000000,
        "merchantCommissionRateAmount": 0.05000000,
        "iyziCommissionRateAmount": 0.01622500,
        "iyziCommissionFee": 0.14750000,
        "blockageRate": 10.00000000,
        "blockageRateAmountMerchant": 0.05500000,
        "blockageRateAmountSubMerchant": 0,
        "blockageResolvedDate": "2016-03-28 09:27:14",
        "subMerchantKey": "subMerchantKey",
        "subMerchantPrice": 0,
        "subMerchantPayoutRate": 0E-8,
        "subMerchantPayoutAmount": 0,
        "merchantPayoutAmount": 0.33127500,
        "convertedPayout": {
          "paidPrice": 0.55000000,
          "iyziCommissionRateAmount": 0.01622500,
          "iyziCommissionFee": 0.14750000,
          "blockageRateAmountMerchant": 0.05500000,
          "blockageRateAmountSubMerchant": 0E-8,
          "subMerchantPayoutAmount": 0E-8,
          "merchantPayoutAmount": 0.33127500,
          "iyziConversionRate": 0,
          "iyziConversionRateAmount": 0,
          "currency": "TRY"
        }
      },
      {
        "itemId": "BI103",
        "paymentTransactionId": "4979",
        "transactionStatus": 2,
        "price": 0.2,
        "paidPrice": 0.22000000,
        "merchantCommissionRate": 10.00000000,
        "merchantCommissionRateAmount": 0.02000000,
        "iyziCommissionRateAmount": 0.00649000,
        "iyziCommissionFee": 0.05900000,
        "blockageRate": 10.00000000,
        "blockageRateAmountMerchant": 0.02200000,
        "blockageRateAmountSubMerchant": 0,
        "blockageResolvedDate": "2016-03-28 09:27:14",
        "subMerchantKey": "subMerchantKey",
        "subMerchantPrice": 0,
        "subMerchantPayoutRate": 0E-8,
        "subMerchantPayoutAmount": 0,
        "merchantPayoutAmount": 0.13251000,
        "convertedPayout": {
          "paidPrice": 0.22000000,
          "iyziCommissionRateAmount": 0.00649000,
          "iyziCommissionFee": 0.05900000,
          "blockageRateAmountMerchant": 0.02200000,
          "blockageRateAmountSubMerchant": 0E-8,
          "subMerchantPayoutAmount": 0E-8,
          "merchantPayoutAmount": 0.13251000,
          "iyziConversionRate": 0,
          "iyziConversionRateAmount": 0,
          "currency": "TRY"
        }
      }
    ]
  }
}